package accord





/*


2. 货币的未来

黄金本是地球上最适合成为货币的物品，但是人们现在却没有使用它进行大规模的交易支付。主要原因有：1. 笨重不便于携带；2. 不可无限分割用于小额支付；3. 长期流通造成磨损耗费；4. 造假掺假技术越发强大。请注意，储量有限并不是它的缺点。在欧洲历史上曾长期使用黄金作为储备的纸币进行流通，这种方式表面上兼具黄金的优点却规避了其作为日常支付手段的缺陷。只不过，没有任何个人和组织禁得住凭空创造钱的诱惑，无论承诺多么坚决，纸币总是会被超发。与历史上在铜币里掺杂其他金属故意造成货币贬值的情况别无二致，甚至由于发行成本的极度降低造成严重通货膨胀从而导致经济的崩溃。这种情况曾反复多次出现。

阻止黄金作为通用支付手段的另外两大具备争议的问题是：1. 储量位置分布不均，地下有金矿的国家相当于坐收全世界的税；2. 无法在经济的增长率和规模大幅变动之时快速调节供应量，容易造成紧缩和钱荒。特别是关于第2点的争论已大量见于奥地利、现代货币和凯恩斯等各个经济学派的著作之中，其中一些认为信用扩张是经济危机的根源、是洪水猛兽，而另一些则坚定认为没有“弹性”的货币将会锁死整个经济的发展。

历史上，货币大致经历了如下几个阶段：

	1. 通用价值物（谷物、布帛、牛羊等）
	2. 稀有稳态物（金、银、铜、贝壳等）
	3. 信用凭证（存款证明、不记名支票等）
	4. 主权信用凭证（法币）

其中第1、2阶段由于无法满足现代商业支付需要而被逐渐淘汰，第3阶段似乎会造成信用膨胀和银行家欺诈带来的经济脆弱及崩溃，人们随即期望政府设立的央行机构体系解决问题（或者更有利于政府），于是走入了第4个阶段，但效果却并不遂人意。

在此我们提出，货币的未来，也就是第5阶段的形态将会是「公认规则」为主体、主干，「个体信用」为分支、补充的开放性电子网络体系，并且会在自由竞争的过程中持续改进和显现出最优的系统。这种「公认规则」不以任何人的意志、权力为转移，不受任何机构的控制，就像没有人能够凭空创造出黄金一样，公平的规则能让全世界有效的参与进来。


《Hacash：一种大规模支付即时清算的点对点金融货币系统》

【摘要】

一、前言
  1. 危机
  2. 货币的未来
  3. 我们需要什么

二、基本原理
  1. 自利原则
  2. 技术理论
  3. 不足

三、通道链清算网络
  1. 横向扩容不可行
  2. 不安全的纵向层级扩容
  3. 自利原则仲裁保护
  4. 主要技术原理
  5. 去中心化原则
  6. 算法及数据结构

四、交易结构
  1. 为何不用智能合约
  2. 基本数据结构
  3. 多重签名地址
  4. 层级股权控制地址
  5. 多方签署
  6. 支付类别
  7. 签名剥离
  8. 手续费动态竞价
  9. 统一标准协议

五、激励

  1. 货币发行算法
  2. 记账权竞争奖励
  3. 交易挖矿
  4. 手续费
  5. 区块钻石
  6. 数据服务

六、隐私
  1. 匿名
  2. 交易混搅服务
  3. 通道冲销

七、设计原则
  1. 简单直观
  2. 执行高效
  3. 数据紧凑
  4. 主链数据保持精简且增长可预估
  5. 可剥离及压缩
  6. 统一协议标准

八、缺陷与风险
  1. 通道链延迟签名攻击
  2. 算力集中化
  3. 价格极端波动难以作为结算单位

九、结论

十、附录
  1. 参考引用
  2. 完整区块数据结构定义及注释
  3. 相关算法代码



 */
